using System;
using System.Collections.Generic;
using System.Linq;
using System.Threading;
using System.Web;

namespace BotApp1.Generator
{
    public class RandomClass
    {
        #region List of Olya
        public List<string> listOlyaGabe_1 = new List<string> { "грошы", "пральны парашок", "патэльня", "прыгожыя завушніцы", "прас", "рондаль", "кватэра",
                                                                "што-небудзь прыемнае", "зорка на небе", "добрая канапа", "нешта для дзяцей", "карціна Пiкаса",
                                                                "мэбля XVI стагодзя", "вершы Рыгора Барадуліна", "яхта", "калейдаскоп", "кампазіцыя з жывых кветак",
                                                                "кававы набор", "вышыўка на заказ", "стыльная біжутэрыя ручной працы", "Карціны для жанчын з крышталяў Swarovsky",
                                                                "Аксэсуары для ваннай пакоі", "залатыя упрыгожванні", "набор: чайнік гліняны з некалькімі кубкамі і ўпакоўкай смачнай элітнай гарбаты",
                                                                "аплачаныя 10 сеансаў масажу", "скураныя пальчаткі і прыгожы шалік", "паштоўкі, зробленыя сваімі рукамі",
                                                                "дыяменты", "паездка ў Італію", "адпачынак на дзень ці два ў высакакласным гатэлі", "вялізны букет руж",
                                                                "змантаваны фільм з фатаграфій пад яе любімыя песні", "партрэт на заказ", "статуэтка пацешных жывёл",
                                                                "скрабы для цела і твару", "увільгатняльнік або іянізатар паветра", "упрыгожваньні з срэбра", "ваза дэкаратыўная",
                                                                "дэкаратыўныя упрыгожванні для дома", "антыкварыят", "мяккія цацкі", "музычная падушка", "вельмі шмат паветраных шароў",
                                                                "прыгожыя заколкі для валасоў", "аўтаматычныя зубныя шчоткі", "генеалагічнае дрэва", "хатні фантан",
                                                                "прыгожы фірмовы кашалёк з парай тройкай зялёных паперак", "мабільны тэлефон з пакемонамі", "наварочаны штодзённік",
                                                                "набор для фондю", "аксэсуары для кухні", "пацешныя формачкі для лёду", "кніга з рэцэптамі", "фотаальбом з цікавым афармленнем",
                                                                "фарфоравыя статуэткі", "букеты з цукерак", "рэпрадукцыя вядомай карціны", "фарфоравая лялька", "наборы для сушы",
                                                                "танцуючыя кветкі і цацкі Flip Flap", "незвычайныя прысмакі", "жывыя кветачкі ў збанку", "парфумерныя падарункі",
                                                                "сметніца з садавінай", "свечкі незвычайнай формы", "стыльны пясочны гадзіннік", "прыгожы і незвычайны парасон",
                                                                "тры сіямскіх коткі", "рэмень(абавязкова каб ад моднага брэнда)", "сонцаахоўныя акуляры", "«Дамская» мышка для кампутара",
                                                                "скрыначкі для упрыгожванняў", "кнігі па вышэйшай матэматыцы", "солевыя лямпы ці падсвечнікі", "паход ў самы модны SPA-салон",
                                                                "паездка на мора", "прагулка на вярблюдзе", "кавалачак горнага крышталя", "соль для ваннай у выглядзе кветак",
                                                                "падарожжа на Корсіку", "падарожжа ў Iсландыю", "дарагі лікёр", "дарагі парфюм", "торт з фатаграфіяй",
                                                                "бінокль тэатральны", "веер", "аўтарская біжутэрыя", "экзатычная расліна ў гаршэчку, абавязкова з інструкцыяй",
                                                                "этнічныя штучкі", "старадаўнія кнігі", "Пеця", "дэкаратыўныя аўтарскія лялькі", "абанемент у салярый",
                                                                "ракеткі і валаны для бадмінтона", "ласты, маска, шапачка і акуляры для плавання", "добрыя калготкі",
                                                                "падвеска або брошка на сумку",  "бірулька для ключоў", "канапавыя падушкі з афармленнем вышыўкай",
                                                                "лічбавы фотаапарат", "квіткі на спектакль \"Пінская шляхта\"", "мяккія тапачкі з «вушамі, мордамі, вачамі»",
                                                                "10-50 кг марожанага, а ў прыдачу пару кіло здобных булачак", "10 кг морквы сырой і 3 літры кефіру",
                                                                "кветкі і любоў", "паход у рэстаран", "арома-мыла", "маленькі сабачка", "падстаўка для кольцаў",
                                                                "элегантны набор пасцельнай бялізны", "мусы і гелі для валасоў", "дарагая туш для павек",
                                                                "кветкі", "фільмы пра Рэмба", "пяцігадовая падпіска на СБ", "парабалічная антэна з адмысловым пакетам спартыўных каналаў",
                                                                "дапаможнік па рамонце тэхнікі", "што-небудзь для Алі і Магдалены", "прывітанне з Забашавічаў",
                                                                "збонік вершаў Васіля Быкава", "модныя панчохі", "беларуска-кітайскі слоўнік", "акіян радасці",
                                                                "95 тэзісаў Мартына Лютэра", "кросны", "хлебапечка", "валенкі", "скура жырафы", "green-card", "нешта вельмі прыемнае",
                                                                "тое, што любіць Оля", "Міколавы пераклад Быкава", "шчырае сяброўства", "кампутарная гульня The Sims",
                                                                "квіткі на воднае пола", "Alfa Romeo Berlinetta 1938 года", "сцэнка ад лялечнікаў", "саламяны капялюш",
                                                                "прыгожыя вокладкі для кніг", "тэрмас", "спартыўны ровар", "самавар", "квіткі ў філармонію", "электроннае піяніна",
                                                                "санкі", "10 кг шакаладу", "home decor", "шаўковы дыван", "100 кг цукру", "штосьці смачнае", "тое, што не шкада", "набор да пікніка",
                                                                "сем тысяч даляраў", "100 літраў бярозавага соку", "фіранкі прыгожыя", "парсючок на гадаванне", "джакузi", "кошык па грыбы хадзіць",
                                                                "апошні альбом гурта \"Троіца\"", "экскурсія ў Прада", "томік Бадлера", "паштоўкі з малюнкамі Альфонса Мухі",
                                                                "мяшэчак цыбулі і кілаграм часнаку", "піжама", "паездка ў Кракаў", "расказы Барона Мюнхгаўзена", "збор твораў Джонатана Свіфта",
                                                                "кніга аповедаў Эдгара По", "казкі Х.Андэрсана", "\"Прыгоды Алісы ў дзівоснай краіне\" Льюіса Кэрала", "укормлены індык"};

        public List<string> listOlyaGabe_2 = new List<string> { "грошы", "пральны парашок", "патэльню", "прыгожыя завушніцы", "прас", "рондаль", "кватэру",
                                                                "што-небудзь прыемнае", "зорку на небе", "добрую канапу", "нешта для дзяцей", "карціну Пiкаса",
                                                                "мэблю XVI стагодзя", "вершы Рыгора Барадуліна", "яхту", "калейдаскоп", "кампазіцыю з жывых кветак",
                                                                "кававы набор", "вышыўку на заказ", "стыльную біжутэрыю ручной працы", "Карціну для жанчын з крышталяў Swarovsky",
                                                                "Аксэсуары для ваннай пакоі", "залатыя упрыгожванні", "набор: чайнік гліняны з некалькімі кубкамі і ўпакоўкай смачнай элітнай гарбаты",
                                                                "аплачаныя 10 сеансаў масажу", "скураныя пальчаткі і прыгожы шалік", "паштоўкі, зробленыя сваімі рукамі",
                                                                "дыяменты", "паездку ў Італію", "адпачынак на дзень ці два ў высакакласным гатэлі", "вялізны букет руж",
                                                                "змантаваны фільм з фатаграфій пад яе любімыя песні", "партрэт на заказ", "статуэтку пацешных жывёл",
                                                                "скрабы для цела і твару", "увільгатняльнік або іянізатар паветра", "упрыгожваньні з срэбра", "вазу дэкаратыўную",
                                                                "дэкаратыўныя упрыгожванні для дома", "антыкварыят", "мяккія цацкі", "музычную падушку", "вельмі шмат паветраных шароў",
                                                                "прыгожыя заколкі для валасоў", "аўтаматычныя зубныя шчоткі", "генеалагічнае дрэва", "хатні фантан",
                                                                "прыгожы фірмовы кашалёк з парай тройкай зялёных паперак", "мабільны тэлефон з пакемонамі", "наварочаны штодзённік",
                                                                "набор для фондю", "аксэсуары для кухні", "пацешныя формачкі для лёду", "кнігу з рэцэптамі", "фотаальбом з цікавым афармленнем",
                                                                "фарфоравыя статуэткі", "букеты з цукерак", "рэпрадукцыю вядомай карціны", "фарфоравую ляльку", "наборы для сушы",
                                                                "танцуючыю кветку і цацкі Flip Flap", "незвычайную прысмаку", "жывую кветачку ў збанку", "парфумерны падарунак",
                                                                "сметніцу з садавінай", "свечку незвычайнай формы", "стыльны пясочны гадзіннік", "прыгожы і незвычайны парасон",
                                                                "тры сіямскіх коткі", "рэмень(абавязкова каб ад моднага брэнда)", "сонцаахоўныя акуляры", "«Дамскую» мышку для кампутара",
                                                                "скрыначку для упрыгожванняў", "кнігі па вышэйшай матэматыцы", "солевыя лямпы ці падсвечнікі", "паход ў самы модны SPA-салон",
                                                                "паездку на мора", "прагулка на вярблюдзе", "кавалачак горнага крышталя", "соль для ваннай у выглядзе кветак",
                                                                "падарожжа на Корсіку", "падарожжа ў Iсландыю", "дарагі лікёр", "дарагі парфюм", "торт з фатаграфіяй",
                                                                "бінокль тэатральны", "веер", "аўтарская біжутэрыю", "экзатычную расліну ў гаршэчку, абавязкова з інструкцыяй",
                                                                "этнічную рэч (вышыванку, дапрыкладу)", "старадаўнюю кнігу", "Пецю", "дэкаратыўную аўтарскую ляльку", "абанемент у салярый",
                                                                "ракетку і валаны для бадмінтона", "ласты, маску, шапачку і акуляры для плавання", "добрыя калготкі",
                                                                "падвеску або брошку на сумку",  "бірульку для ключоў", "канапавую падушку з афармленнем вышыўкай",
                                                                "лічбавы фотаапарат", "квіткі на спектакль \"Пінская шляхта\"", "мяккія тапачкі з «вушамі, мордамі, вачамі»",
                                                                "10-50 кг марожанага, а ў прыдачу пару кіло здобных булачак", "10 кг морквы сырой і 3 літры кефіру",
                                                                "кветкі і любоў", "паход у рэстаран", "арома-мыла", "маленькую сабачку", "падстаўку для кольцаў",
                                                                "элегантны набор пасцельнай бялізны", "мусы і гелі для валасоў", "дарагую туш для павек",
                                                                "кветкі", "фільмы пра Рэмба", "пяцігадовую падпіску на СБ", "парабалічную антэну з адмысловым пакетам спартыўных каналаў",
                                                                "дапаможнік па рамонце тэхнікі", "што-небудзь для Алі і Магдалены", "прывітанне з Забашавічаў",
                                                                "збонік вершаў Васіля Быкава", "модныя панчохі", "беларуска-кітайскі слоўнік", "акіян радасці",
                                                                "95 тэзісаў Мартына Лютэра", "кросны", "хлебапечку", "валенкі", "скуру жырафы", "green-card", "нешта вельмі прыемнае",
                                                                "тое, што любіць Оля", "Міколавы пераклад Быкава", "шчырае сяброўства", "кампутарную гульню The Sims",
                                                                "квіткі на воднае пола", "Alfa Romeo Berlinetta 1938 года", "сцэнку ад лялечнікаў", "саламяны капялюш",
                                                                "прыгожыя вокладкі для кніг", "тэрмас", "спартыўны ровар", "самавар", "квіткі ў філармонію", "электроннае піяніна",
                                                                "санкі", "10 кг шакаладу", "home decor", "шаўковы дыван", "100 кг цукру", "штосьці смачнае", "тое, што не шкада", "набор да пікніка",
                                                                "сем тысяч даляраў", "100 літраў бярозавага соку", "фіранкі прыгожыя", "парсючка на гадаванне", "джакузi", "кошык па грыбы хадзіць",
                                                                "апошні альбом гурта \"Троіца\"", "экскурсію ў Прада", "томік Бадлера", "паштоўкі з малюнкамі Альфонса Мухі",
                                                                "мяшэчак цыбулі і кілаграм часнаку", "піжаму", "паездку ў Кракаў", "расказы Барона Мюнхгаўзена", "збор твораў Джонатана Свіфта",
                                                                "кнігу аповедаў Эдгара По", "казкі Х.Андэрсана", "\"Прыгоды Алісы ў дзівоснай краіне\" Льюіса Кэрала", "укормленага індыка"};
        #endregion
        #region List of Petro
        public List<string> listPetroGabe_1 = new List<string> { "грошы", "бензін", "інструмант добры", "кватэра", "экскурсія ў калгас",
                                                                "што-небудзь прыемнае", "добрая канапа", "нешта для дзяцей", "карціна Пiкаса",
                                                                "мэбля XVI стагодзя", "вершы Рыгора Барадуліна", "яхта", "калейдаскоп", 
                                                                "набор: чайнік гліняны з некалькімі кубкамі і ўпакоўкай смачнай элітнай гарбаты",
                                                                "паездка ў Італію", "адпачынак на дзень ці два ў высакакласным гатэлі", "вялізны букет руж",
                                                                "партрэт на заказ", "статуэтка пацешных жывёл",
                                                                "увільгатняльнік або іянізатар паветра", 
                                                                "дэкаратыўныя упрыгожванні для дома", "антыкварыят", 
                                                                "аўтаматычныя зубныя шчоткі", "генеалагічнае дрэва", "хатні фантан",
                                                                "прыгожы фірмовы кашалёк з парай тройкай зялёных паперак", "мабільны тэлефон з пакемонамі", "наварочаны штодзённік",
                                                                "пацешныя формачкі для лёду", "фотаальбом з цікавым афармленнем",
                                                                "рэпрадукцыя вядомай карціны", "наборы для сушы",
                                                                "незвычайныя прысмакі", "сметніца з садавінай", "стыльны пясочны гадзіннік", "прыгожы і незвычайны парасон",
                                                                "тры сіямскіх коткі","сонцаахоўныя акуляры", "зімовыя пакрышкі",
                                                                "кнігі па вышэйшай матэматыцы", "сямейнае фота раздрукаванае на халсце",
                                                                "паездка на мора", "прагулка на вярблюдзе", "кавалачак горнага крышталя", 
                                                                "падарожжа на Корсіку", "падарожжа ў Iсландыю", "дарагі лікёр", "торт з фатаграфіяй",
                                                                "бінокль тэатральны", 
                                                                "этнічныя штучкі", "старадаўнія кнігі", "Оля", "абанемент у басейн",
                                                                "ракеткі і валаны для бадмінтона", "ласты, маска, шапачка і акуляры для плавання", "добрыя джынсы",
                                                                "бірулька для ключоў", "канапавыя падушкі з афармленнем вышыўкай",
                                                                "лічбавы фотаапарат", "квіткі на спектакль \"Пінская шляхта\"", "мяккія тапачкі з «вушамі, мордамі, вачамі»",
                                                                "10 кг дранікаў, а ў прыдачу пару кіло сасісак", "10 кг морквы сырой і 3 літры кефіру",
                                                                "сапраўднае сяброўства", "маленькі сабачка", "кракадзіл", "паходны тапор",
                                                                "компас", "фільмы пра Рэмба", "пяцігадовая падпіска на СБ", "парабалічная антэна з адмысловым пакетам спартыўных каналаў",
                                                                "дапаможнік па рамонце тэхнікі", "што-небудзь для Алі і Магдалены", "прывітанне з Забашавічаў",
                                                                "збонік вершаў Васіля Быкава", "модныя панчохі", "беларуска-польскі слоўнік", "акіян радасці",
                                                                "95 тэзісаў Мартына Лютэра", "хлебапечка", "валенкі", "скура жырафы", "green-card", "нешта вельмі прыемнае",
                                                                "тое, што любіць Пеця", "Міколавы пераклад Быкава", "шчырае сяброўства", "кампутарная гульня Civilization",
                                                                "квіткі на воднае пола", "Alfa Romeo Berlinetta 1938 года", "сцэнка ад лялечнікаў", "саламяны капялюш",
                                                                "тэрмас", "спартыўны ровар", "самавар", "квіткі ў філармонію", "электроннае піяніна",
                                                                "санкі", "10 кг шакаладу", "home decor", "шаўковы дыван", "100 кг цукру", "штосьці смачнае", "тое, што не шкада", "набор да пікніка",
                                                                "сем тысяч даляраў", "100 літраў бярозавага соку", "парсючок на гадаванне", "джакузi", "кошык па грыбы хадзіць",
                                                                "апошні альбом гурта \"Троіца\"", "экскурсія ў Прада", "томік Бадлера", "паштоўкі з малюнкамі Альфонса Мухі",
                                                                "мяшэчак цыбулі і кілаграм часнаку", "піжама", "паездка ў Кракаў", "расказы Барона Мюнхгаўзена", "збор твораў Джонатана Свіфта",
                                                                "кніга аповедаў Эдгара По", "казкі Х.Андэрсана", "\"Прыгоды Алісы ў дзівоснай краіне\" Льюіса Кэрала", "укормлены індык",
                                                                "антырадары", "фотасесія для дваіх", "рэчы для рыбака", "звязаны сваімі рукамі швэдар", "скрыня з інструмантам",
                                                                "вокладка для правоў у стылі «Декупаж»", "верталёт на пульце", "скачкі на джолі-джамперах для дваіх",
                                                                "майстар-клас стральбы з лука", "паход у аквапарк", "скачок з парашутам", "занятак віндсерфінгам", "палёт на параплане",
                                                                "аўтамабільны столік", "дартс", "электронная кніга", "аўтамабільны пыласос", "арыгінальны скураны рэмень",
                                                                "сертыфікат на аўтамыйку", "скураны партфель", "швейцарскі гадзіннік", "асартымент крамы «Стары салдат»", "фляга",
                                                                "палёт на верталёце", "тэлескоп", "горны ровар", "галстук", "кампутарнае крэсла", "адпачынак з лялечнікамі",
                                                                "зорка, названая ў гонар яго", "гумавая лодка", "татуіроўка", "тэрмас для паходаў у лес", "скейтборд",
                                                                "дошка для серфінгу", "велатрэнажор", "апусканне на глыбіню", "гантэлі", "лыжы і лыжныя палкі", "тэрмабялізна",
                                                                "заплечнік для паходаў", "футбольны мяч", "спартыўны лук", "талерка для фрысбі", "складное крэсла для рыбалкі",
                                                                "гарнітура для тэлефона", "чахол для тэлефона", "ліхтарык", "дамкрат", "электрычны чайнік", "спальны мяшок",
                                                                "кававарка", "майка з Бэтманам", "набор для барбекю", "гальштук матылёк", "стыльныя падцяжкі", "запанкі дарагушчыя",
                                                                "шапка", "цёплы швэдар", "венік для лазні", "альбом для малявання", "мадэлі самалётаў або танкаў",
                                                                "атлас(або карта) мясцовасці, куды ён любіць ездзіць", "цёплы мяккі плед", "вадзяны пісталет", "надзіманае крэсла",
                                                                "сертыфікат на адпачынак на тры дні ў Забашавічы"};
        public List<string> listPetroGabe_2 = new List<string> { "грошы", "бензін", "інструмант добры", "кватэру", "экскурсію ў калгас",
                                                                "што-небудзь прыемнае", "добрую канапу", "нешта для дзяцей", "карціну Пiкаса",
                                                                "мэбля XVI стагодзя", "вершы Рыгора Барадуліна", "яхта", "калейдаскоп",
                                                                "набор: чайнік гліняны з некалькімі кубкамі і ўпакоўкай смачнай элітнай гарбаты",
                                                                "паездку ў Італію", "адпачынак на дзень ці два ў высакакласным гатэлі", "вялізны букет руж",
                                                                "партрэт на заказ", "статуэтку пацешных жывёл",
                                                                "увільгатняльнік або іянізатар паветра",
                                                                "дэкаратыўныя упрыгожванні для дома", "антыкварыят",
                                                                "аўтаматычныя зубныя шчоткі", "генеалагічнае дрэва", "хатні фантан",
                                                                "прыгожы фірмовы кашалёк з парай тройкай зялёных паперак", "мабільны тэлефон з пакемонамі", "наварочаны штодзённік",
                                                                "пацешныя формачкі для лёду", "фотаальбом з цікавым афармленнем",
                                                                "рэпрадукцыю вядомай карціны", "наборы для сушы",
                                                                "незвычайныя прысмакі", "сметніцу з садавінай", "стыльны пясочны гадзіннік", "прыгожы і незвычайны парасон",
                                                                "тры сіямскіх коткі","сонцаахоўныя акуляры", "зімовыя пакрышкі",
                                                                "кнігі па вышэйшай матэматыцы", "сямейнае фота раздрукаванае на халсце",
                                                                "паездку на мора", "прагулку на вярблюдзе", "кавалачак горнага крышталя",
                                                                "падарожжа на Корсіку", "падарожжа ў Iсландыю", "дарагі лікёр", "торт з фатаграфіяй",
                                                                "бінокль тэатральны",
                                                                "этнічныя штучкі", "старадаўнія кнігі", "Олю", "абанемент у басейн",
                                                                "ракеткі і валаны для бадмінтона", "ласты, маска, шапачка і акуляры для плавання", "добрыя джынсы",
                                                                "бірульку для ключоў", "канапавую падушку з афармленнем вышыўкай",
                                                                "лічбавы фотаапарат", "квіткі на спектакль \"Пінская шляхта\"", "мяккія тапачкі з «вушамі, мордамі, вачамі»",
                                                                "10 кг дранікаў, а ў прыдачу пару кіло сасісак", "10 кг морквы сырой і 3 літры кефіру",
                                                                "сапраўднае сяброўства", "маленькую сабачку", "кракадзіла", "паходны тапор",
                                                                "компас", "фільмы пра Рэмба", "пяцігадовая падпіска на СБ", "парабалічную антэна з адмысловым пакетам спартыўных каналаў",
                                                                "дапаможнік па рамонце тэхнікі", "што-небудзь для Алі і Магдалены", "прывітанне з Забашавічаў",
                                                                "збонік вершаў Васіля Быкава", "модныя панчохі", "беларуска-польскі слоўнік", "акіян радасці",
                                                                "95 тэзісаў Мартына Лютэра", "хлебапечку", "валенкі", "скура жырафы", "green-card", "нешта вельмі прыемнае",
                                                                "тое, што любіць Пеця", "Міколавы пераклад Быкава", "шчырае сяброўства", "кампутарную гульня Civilization",
                                                                "квіткі на воднае пола", "Alfa Romeo Berlinetta 1938 года", "сцэнку ад лялечнікаў", "саламяны капялюш",
                                                                "тэрмас", "спартыўны ровар", "самавар", "квіткі ў філармонію", "электроннае піяніна",
                                                                "санкі", "10 кг шакаладу", "home decor", "шаўковы дыван", "100 кг цукру", "штосьці смачнае", "тое, што не шкада", "набор да пікніка",
                                                                "сем тысяч даляраў", "100 літраў бярозавага соку", "парсючок на гадаванне", "джакузi", "кошык па грыбы хадзіць",
                                                                "апошні альбом гурта \"Троіца\"", "экскурсію ў Прада", "томік Бадлера", "паштоўкі з малюнкамі Альфонса Мухі",
                                                                "мяшэчак цыбулі і кілаграм часнаку", "піжаму", "паездку ў Кракаў", "расказы Барона Мюнхгаўзена", "збор твораў Джонатана Свіфта",
                                                                "кнігу аповедаў Эдгара По", "казкі Х.Андэрсана", "\"Прыгоды Алісы ў дзівоснай краіне\" Льюіса Кэрала", "укормленага індыка",
                                                                "антырадары", "фотасесію для дваіх", "рэчы для рыбака", "звязаны сваімі рукамі швэдар", "скрыню з інструмантам",
                                                                "вокладку для правоў у стылі «Декупаж»", "верталёт на пульце", "скачкі на джолі-джамперах для дваіх",
                                                                "майстар-клас стральбы з лука", "паход у аквапарк", "скачок з парашутам", "занятак віндсерфінгам", "палёт на параплане",
                                                                "аўтамабільны столік", "дартс", "электронную кніга", "аўтамабільны пыласос", "арыгінальны скураны рэмень",
                                                                "сертыфікат на аўтамыйку", "скураны партфель", "швейцарскі гадзіннік", "асартымент крамы «Стары салдат»", "флягу",
                                                                "палёт на верталёце", "тэлескоп", "горны ровар", "галстук", "кампутарнае крэсла", "адпачынак з лялечнікамі",
                                                                "зорку, названую ў гонар яго", "гумавую лодка", "татуіроўку", "тэрмас для паходаў у лес", "скейтборд",
                                                                "дошка для серфінгу", "велатрэнажор", "апусканне на глыбіню", "гантэлі", "лыжы і лыжныя палкі", "тэрмабялізну",
                                                                "заплечнік для паходаў", "футбольны мяч", "спартыўны лук", "талерку для фрысбі", "складное крэсла для рыбалкі",
                                                                "гарнітуру для тэлефона", "чахол для тэлефона", "ліхтарык", "дамкрат", "электрычны чайнік", "спальны мяшок",
                                                                "кававарку", "майку з Бэтманам", "набор для барбекю", "гальштук матылёк", "стыльныя падцяжкі", "запанкі дарагушчыя",
                                                                "шапку", "цёплы швэдар", "венік для лазні", "альбом для малявання", "мадэлі самалётаў або танкаў",
                                                                "атлас(або карта) мясцовасці, куды ён любіць ездзіць", "цёплы мяккі плед", "вадзяны пісталет", "надзіманае крэсла",
                                                                "сертыфікат на адпачынак на тры дні ў Забашавічы"};
        #endregion
        #region List of Predicat Predicat
        public List<string> listGabePredicatPredicat_1 = new List<string> {"Ну што падарыць? ", "Зараз, трошкі падумаю... ", "Добра, што мяне запыталіся, бо я майстра ў падарунках. Дык вось. ",
                                                                "Трэба падумаць... ", "Які падарунак пытаеце? ", "Да падарункаў трэба з розумам пыходзіць, а не абы як! ",
                                                                " ", " ", " ", " ",
                                                                "Хм... Нешта не ідзе ў галаву нічога.. А! Вось. ", "Дык усё што заўгодна можна падарыць, але ж... ",
                                                                "Добрае пытанне! I па адрасу. Толькі я ведаю, што патрэбна дарыць жанчынам. ", "Зараз адкажу... ", " ", " ", " "};
        #endregion
        #region List of Predicat Petro
        public List<string> listGabePredicatPetro_1 = new List<string> {"Я ведаю, што добры падарунак - гэта ", "Сапраўдны падарунак гэта ", "Добры падарунак для Пеці гэта ", "Я думаю, што трэба падарыць такую рэч... Ну, карацей, гэта  ",
                                                                    "Мне здаецца, што добры падарунак вось што:  ", "Мне здаецца, што падыйдзе вось што: ", "Мне здаецца, што сапраўдны падарунак гэта ",
                                                                    "Самы лепшы ў свеце падарунак для хлопца гэта ",  "Самы лепшы ў свеце падарунак, канечне, гэта ", "Я мяркую, што Пеця не адмовіцца, калі падарунак будзе ",
                                                                    "Штосьці мне падказвае, што Пеця не адмовіцца, калі падарункам будзе ",
                                                                    "Я упэўнены, што Пеця будзе вельмі рады, калі ён, зніме ўпакоўку і ўбачыць, што там ", "Пеця мне казаў, што хоча толькі адну рэч. I гэта ",
                                                                    "Пеце патрэбна адное. Гэта ", "Пеце вельмі зараз не хапае аднаго. I чаго ж вы думалі? Не ведаеце? А гэта усяго толькі ",
                                                                    "Я б дарыў толькі адное. I гэта ", "У мяне на прыкмеце лепшы падарунак на свеце. Гэта "};
        public List<string> listGabePredicatPetro_2 = new List<string> {"Мая прабабка казала, што раней яны дарылі адзін аднаму ",
                                                                    "Мой прадзед казаў, што раней яны дарылі адзін аднаму ",
                                                                    "Мая прабабка казала, што раней (а было то 80 год таму) яны дарылі сваім сябрам ",
                                                                    "Мой прадзед казаў, што раней (а было то 80 год таму) яны дарылі сваім сябрам ",
                                                                    "Мая прабабка казала, што раней (а было то 80 год таму) яны дарылі сваім сябрам ",
                                                                    "Мой прадзед казаў, што раней (а было то 80 год таму) яны дарылі сваім сябрам ",
                                                                    "Мая прабабка казала, што раней (а было то 80 год таму) добраму чалавеку дарылі ",
                                                                    "Мой прадзед казаў, што раней (а было то 80 год таму) добраму чалавеку дарылі ",
                                                                    "Я ведаю, што добры падарунак будзе, калі мы падорым ", "Давайце падорым яму ", "Што падарыць для Пеце? Падорым ", "Я думаю, што трэба падарыць ",
                                                                    "Мне здаецца, што была б добра падараваць ", "А давайце купім для яго ", "Мне здаецца, што трэба дарыць ",
                                                                    "А давайце, давайце, давайце падорым ",  "Самым лепшым будзе падараваць ", "Я мяркую, што Пеця не адмовіцца, калі мы падорым яму ",
                                                                    "Штосьці мне падказвае, што Пеця не адмовіцца, калі падаруем ",
                                                                    "Я упэўнены, што Пеця будзе вельмі рады, калі ён, зніме ўпакоўку і ўбачыць, што падаравалі ", "Пеця мне казала, што хоча толькі адну рэч. Якую? ",
                                                                    "Пеце патрэбна адное. Купім яму ", "Пеце вельмі зараз не хапае аднаго. Ён марыць каб атрымаць ",
                                                                    "Я б дарыў толькі адное: ", "Слухай мой загад! Пеця атрымае ў падарунак "};
        #endregion
        #region List of Predicat Olya
        public List<string> listGabePredicat_1 = new List<string> {"Я ведаю, што добры падарунак - гэта ", "Сапраўдны падарунак гэта ", "Добры падарунак для Олі гэта ", "Я думаю, што трэба падарыць такую рэч... Ну, карацей, гэта  ",
                                                                    "Мне здаецца, што добры падарунак вось што:  ", "Мне здаецца, што падыйдзе вось што: ", "Мне здаецца, што сапраўдны падарунак гэта ",
                                                                    "Самы лепшы ў свеце падарунак для дзяўчыны гэта ",  "Самы лепшы ў свеце падарунак, канечне, гэта ", "Я мяркую, што Оля не адмовіцца, калі падарунак будзе ",
                                                                    "Штосьці мне падказвае, што Оля не адмовіцца, калі падарункам будзе ",
                                                                    "Я упэўнены, што Оля будзе вельмі рада, калі яна, зніме ўпакоўку і ўбачыць, што там ", "Оля мне казала, што хоча толькі адну рэч. I гэта ",
                                                                    "Оле патрэбна адное. Гэта ", "Оле вельмі зараз не хапае аднаго. I чаго ж вы думалі? Не ведаеце? А гэта усяго толькі ",
                                                                    "Я б дарыў толькі адное. I гэта ", "У мяне на прыкмеце лепшы падарунак на свеце. Гэта "};
        public List<string> listGabePredicat_2 = new List<string> {"Мая прабабка казала, што раней яны дарылі адзін аднаму ",
                                                                    "Мой прадзед казаў, што раней яны дарылі адзін аднаму ",
                                                                    "Мая прабабка казала, што раней (а было то 80 год таму) яны дарылі сваім сябрам ",
                                                                    "Мой прадзед казаў, што раней (а было то 80 год таму) яны дарылі сваім сябрам ",
                                                                    "Мая прабабка казала, што раней (а было то 80 год таму) яны дарылі сваім сябрам ",
                                                                    "Мой прадзед казаў, што раней (а было то 80 год таму) яны дарылі сваім сябрам ",
                                                                    "Мая прабабка казала, што раней (а было то 80 год таму) добраму чалавеку дарылі ",
                                                                    "Мой прадзед казаў, што раней (а было то 80 год таму) добраму чалавеку дарылі ",
                                                                    "Я ведаю, што добры падарунак будзе, калі мы падорым ", "Давайце падорым ёй ", "Што падарыць для Олі? Падорым ", "Я думаю, што трэба падарыць ",
                                                                    "Мне здаецца, што была б добра падараваць ", "А давайце купім для яе ", "Мне здаецца, што трэба дарыць ",
                                                                    "А давайце, давайце, давайце падорым ",  "Самым лепшым будзе падараваць ", "Я мяркую, што Оля не адмовіцца, калі мы падорым ёй ",
                                                                    "Штосьці мне падказвае, што Оля не адмовіцца, калі падаруем ",
                                                                    "Я упэўнены, што Оля будзе вельмі рада, калі яна, зніме ўпакоўку і ўбачыць, што падаравалі ", "Оля мне казала, што хоча толькі адну рэч. Якую? ",
                                                                    "Оле патрэбна адное. Купім ёй ", "Оле вельмі зараз не хапае аднаго. Яна марыць каб атрымаць ",
                                                                    "Я б дарыў толькі адное: ", "Слухай мой загад! Оля атрымае ў падарунак "};
        #endregion
        #region List of Postdicat Petro
        public List<string> listGabePostdicatPetro_1 = new List<string> {"Гэта лепшае, што можна прыдумаць!", "Ці вы не згодны?", "Я маю рацыю!", " ", " ", "Ці хтосьці можа прапанаваць лепшае?",
                                                                    "I гэта сапраўды патрэбна!","Ну? Ці я не правы?", "Я ведаю, што кажу.", "Вось як! Дрэннага не параю.",
                                                                    "Вось як! Толькі лепшыя парады. Звяртайцеся!", "Iдэя на мільён!",
                                                                    "Ну, як вам ідэя? Бачу, што спадабалася. Як у нас гавораць: баба з возу, каню лягчэй!",
                                                                    "Хто можа прапанаваць што лепшае?", "Калі што, звяртайцеся.", "Што скажыце?", "Ну, як ідэйка?", "Што? Думаеце гэта не падыйдзе?",
                                                                    "Што? Думаеце гэта не падыйдзе? Гэта Мікола насамрэч мне падказаў. Яго ідэя.", "Ну, што браты скажуць на гэта?",
                                                                    "Спадабалася ідэя? 100 адсодкаў!", "I гэта маё апошняе слова.", "Як мая прапанова? Штосьці не чую апладысментаў.",
                                                                    "Ну вось! Па вашых тварах бачу, што не спадабалася мая прапанова..",
                                                                    "Ну вось! Па вашых тварах бачу, што не спадабалася прапанова.. Але ж, насамрэч, гэта Юля Хумала мне падказала.",
                                                                    "А! Як? Добрая ідэя. Анягож!", "Добрая ідэя? Анягож. Гэта Лёша Рассыльны мне падказаў.",
                                                                    "I чыя вы думаеце гэта ідэя? У Лены Хадасевіч узяў", "P.S. Iдэя не мая. Пан Кісель падказаў.", "P.S. Iдэя не зусім мая. Мікола падказаў.",
                                                                    " ", "P.S. Iдэя не зусім мая. Узята ў Машы Маляўкі.", "Калі што, спачатку тое ж і Вераніка прапаноўвала.", "Люблю сябе за такія знаходкі!",
                                                                    "Памятаю, тое ж і Таня Робак прапаноўвала.", "Ці я ж не разумнічка за такія ідэі?", "Тое, што сапраўды патрэбна для жанчыны.",
                                                                    "Ох і падабаецца мне мая прапанова!", "Iдэю ў Юлі скраў", "Насамрэч, гэта Маша мне па сакрэце падказала. Яна ведае, што патрэбна.",
                                                                    "Скажу па сакрэце, гэта ідэя Лёшы Рассыльнага", "Між намі: Пеця казаў, што тое і хоча.", " ", " ", " ", ":)",
                                                                    "))))))))", "))", "8)", "))))))))))))))", "Толькі прашу. Не слухайце парад Лёшы Кісяля. А то нараіў мне аднойчы!",
                                                                    "Каб я здароў!", "Каб я здароў! :)", "Каб я здароў! )))))))", " ", "Толькі не кажыце яму, што гэта я параіў. Добра?"};
        #endregion
        #region List of Postdicat Olya
        public List<string> listGabePostdicat_1 = new List<string> {"Гэта лепшае, што можна прыдумаць!", "Ці вы не згодны?", "Я маю рацыю!", " ", " ", "Ці хтосьці можа прапанаваць лепшае?",
                                                                    "I гэта сапраўды патрэбна!","Ну? Ці я не правы?", "Я ведаю, што кажу.", "Вось як! Дрэннага не параю.",
                                                                    "Вось як! Толькі лепшыя парады. Звяртайцеся!", "Iдэя на мільён!",
                                                                    "Ну, як вам ідэя? Бачу, што спадабалася. Як у нас гавораць: баба з возу, каню лягчэй!",
                                                                    "Хто можа прапанаваць што лепшае?", "Калі што, звяртайцеся.", "Што скажыце?", "Ну, як ідэйка?", "Што? Думаеце гэта не падыйдзе?",
                                                                    "Што? Думаеце гэта не падыйдзе? Гэта Мікола насамрэч мне падказаў. Яго ідэя.", "Ну, што браты скажуць на гэта?",
                                                                    "Спадабалася ідэя? 100 адсодкаў!", "I гэта маё апошняе слова.", "Як мая прапанова? Штосьці не чую апладысментаў.",
                                                                    "Ну вось! Па вашых тварах бачу, што не спадабалася мая прапанова..",
                                                                    "Ну вось! Па вашых тварах бачу, што не спадабалася прапанова.. Але ж, насамрэч, гэта Юля Хумала мне падказала.",
                                                                    "А! Як? Добрая ідэя. Анягож!", "Добрая ідэя? Анягож. Гэта Лёша Рассыльны мне падказаў.",
                                                                    "I чыя вы думаеце гэта ідэя? У Лены Хадасевіч узяў", "P.S. Iдэя не мая. Пан Кісель падказаў.", "P.S. Iдэя не мая. Мікола падказаў.",
                                                                    " ", "P.S. Iдэя не мая. Узята ў Машы Маляўкі", "Калі што, спачатку тое ж і Вераніка прапаноўвала.", "Люблю сябе за такія знаходкі!",
                                                                    "Памятаю, тое ж і Таня Робак прапаноўвала.", "Ці я ж не разумнічка за такія ідэі?", "Тое, што сапраўды патрэбна для жанчыны.",
                                                                    "Ох і падабаецца мне мая прапанова!", "Iдэю ў Юлі скраў", "Насамрэч, гэта Маша мне па сакрэце падказала. Яна ведае, што патрэбна.",
                                                                    "Скажу па сакрэце, гэта ідэя Лёшы Рассыльнага", "Між намі: Оля казала, што тое і хоча.", " ", " ", " ", ":)",
                                                                    "))))))))", "))", "8)", "))))))))))))))", "Толькі прашу. Не слухайце парад Лёшы Кісяля. А то нараіў мне аднойчы!",
                                                                    "Каб я здароў!", "Каб я здароў! :)", "Каб я здароў! )))))))", " ", "Толькі не кажыце ёй, што гэта я параіў. Добра?"};
        #endregion
        #region List of All Phrases
        public List<string> listAllPhrasesGabe = new List<string> {"Ой, лялечнекі, заўсёды вы мяне здзіўляеце сваімі пытаннямі... Нават і не скажу адразу..",
                                                                    "Ну скуль я ведаю, што дарыць? У Міколы пытайцеся.",
                                                                    "Што падарыць? Складанае пытанне. Калі б вы запыталі, напрыклад, што падырыць Лене Хадасевіч, то от, адразу ясна што. Гадзіннік!",
                                                                    "Ну, галоўнае дарыць тое, што сапраўды патрэбна. А то атрымоўваецца: \"Прышый кабыля хвост, а ў яе й свой ёсьць\"",
                                                                    "А давайце так. У краіне крызіс. Нічога дарыць не будзем!\r\nЖартую я.",
                                                                    "От пытанне, канешне, для мяне, трэба трошкі падумаць..",
                                                                    "А што, самі думаць развучыліся? А ну хуценька!",
                                                                    "Раней вось што казалі: Калі нехта нешта пазычае, ці бярэ падарунак, дык мае тады вясёлы погляд, а калі аддае, дык сумны й злосны.",
                                                                    "Дык а самі нічога не прыдумалі? Падумайце яшчэ трошкі"};
        #endregion
        #region Func of All
        static IEnumerable<int> Generator(int max)
        {
            Random r = new Random();
            while(true)
            {
                yield return r.Next(max);
            }
        }

        public string GetStrNumbers(int max, int count)
        {
            int var = 0;
            string str = "";
            foreach(var item in Generator(max).Take(count))
            {
                var = item;
                str += var.ToString() + " ";
            }
            return str;
            
        }

        public int GetIntNumber(int max)
        {
            Random r = new Random();
            return r.Next(0, max);
        }

        private string GetRandomElement(List<string> list)
        {
            Random r = new Random();
            return list[r.Next(0, list.Count())];
        }

        private string GetRandomElementPredicate(List<string> list) //дополнительная рандом, чтобы не повторялись значения
        {
            Random r = new Random();
            return list[r.Next(0, list.Count())];
        }
        #endregion
        #region Func of 1 -> imenitelnyi Olya
        public string GetOlyaGabe_1()
        {
            return GetRandomElement(listOlyaGabe_1);
        }

        public string GetPredicateGabe_1()
        {
            var result1 = GetRandomElement(listGabePredicatPredicat_1);
            Thread.Sleep(120);
            var result2 = GetRandomElementPredicate(listGabePredicat_1);
            return (result1 + result2);
        }

        public string GetPostdicatGabe_1()
        {
            return GetRandomElement(listGabePostdicat_1);
        }

        public string GetResultOlyaGabe_1()
        {
            var result = GetPredicateGabe_1() + GetOlyaGabe_1();
            Thread.Sleep(120);
            result += ". " + GetPostdicatGabe_1();
            return result;
        }
        #endregion
        #region Func of 2 -> Vinitelnyi Olya
        public string GetOlyaGabe_2()
        {
            return GetRandomElement(listOlyaGabe_2);
        }

        public string GetPredicateGabe_2()
        {
            var result1 = GetRandomElement(listGabePredicatPredicat_1);
            Thread.Sleep(120);
            var result2 = GetRandomElementPredicate(listGabePredicat_2);
            return (result1 + result2);
        }
        public string GetResultOlyaGabe_2()
        {
            var result = GetPredicateGabe_2() + GetOlyaGabe_2();
            Thread.Sleep(120);
            result += ". " + GetPostdicatGabe_1();
            return result;
        }
        #endregion
        #region Func of 1 -> imenitelnyi Petro
        public string GetPetroGabe_1()
        {
            return GetRandomElement(listPetroGabe_1);
        }

        public string GetPredicatePetroGabe_1()
        {
            var result1 = GetRandomElement(listGabePredicatPredicat_1);
            Thread.Sleep(120);
            var result2 = GetRandomElementPredicate(listGabePredicatPetro_1);
            return (result1 + result2);
        }

        public string GetPostdicatPetroGabe_1()
        {
            return GetRandomElement(listGabePostdicatPetro_1);
        }

        public string GetResultPetroGabe_1()
        {
            var result = GetPredicatePetroGabe_1() + GetPetroGabe_1();
            Thread.Sleep(120);
            result += ". " + GetPostdicatPetroGabe_1();
            return result;
        }
        #endregion
        #region Func of 2 -> Vinitelnyi Petro
        public string GetPetroGabe_2()
        {
            return GetRandomElement(listPetroGabe_2);
        }

        public string GetPredicatePetroGabe_2()
        {
            var result1 = GetRandomElement(listGabePredicatPredicat_1);
            Thread.Sleep(120);
            var result2 = GetRandomElementPredicate(listGabePredicatPetro_2);
            return (result1 + result2);
        }
        public string GetResultPetroGabe_2()
        {
            var result = GetPredicatePetroGabe_2() + GetPetroGabe_2();
            Thread.Sleep(120);
            result += ". " + GetPostdicatPetroGabe_1();
            return result;
        }
        #endregion
        #region Func of All Phrases Gabe
        public string GetAllPhrasesGabe()
        {
            Thread.Sleep(120);
            return GetRandomElementPredicate(listAllPhrasesGabe);
        }
        public string GetResultAllPhrasesGabe()
        {
            var result = GetAllPhrasesGabe();
            return result;
        }
        #endregion
    }
}